# Создайте список любимых музыкантов..
# группы и исполнители-все вместе(мое)
music = ['Enigma', 'Savage', 'C.C.Catch']
music.append('Aqua')
music.append('Modern Talking')
music.append('John Bon Jovy')
music.append('F.R.David')
music.append('Ария')
music.append('DDT')
music.append('Чай"Ф')
print(music)
