# Составьте словарь кортежей?где каждый
# кортеж содержит широту и долготу того места,
# в котором вы жили или которое посещали
#
Gorno_Altaysk = (51.94219, 85.97194)
Telezkoe = (51.6089249, 87.6585388)
Barnaul = (53.3606, 837636)
Ekaterinburg = (56.8519, 60.6122)
NiNo = (56.32867, 44.00205)
Rabotky = (56.04147, 44.60265)
Lan = {}
Lan['Горно-Алтайск'] = Gorno_Altaysk
Lan['Телецкое'] = Telezkoe
Lan['Барнаул'] = Barnaul
Lan['Екатеринбург'] = Ekaterinburg
Lan['Нижний Новгород'] = NiNo
Lan['Работки'] = Rabotky
print(Lan)
